using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace sidonia.models_and_secondary.Secondary.Utils
{
    public class AddressUtils
    {
        //1. Сгенерировать город
        public static string generateCity()
        {
            return AddressUtils.Cities[SimpleUtils.generateInteger(0, AddressUtils.Cities.Length - 1)];
        }

        //2. Сгенерировать улицу
        public static string generateStreet()
        {
            return AddressUtils.Streets[SimpleUtils.generateInteger(0, AddressUtils.Streets.Length - 1)];
        }

        //3. Сгенерировать номер дома
        public static string generateBuilding()
        {
            return $"{ SimpleUtils.generateInteger(1, 70)}{AddressUtils.buildingLetters[SimpleUtils.generateInteger(0, AddressUtils.buildingLetters.Length - 1)]}";
        }

        //4. Сгенерировать квартиру
        public static string generateApartment()
        {
            return $"{ SimpleUtils.generateInteger(1, 50)}";
        }

        //МАССИВЫ ДЛЯ ГЕНЕРАЦИИ
        //1.Массив букв для обозначения домов
        public static readonly string[] buildingLetters = new string[] {
          "а", "б", "в", "г", "д"
        };

        //2. Массив городов
        public static string[] Cities = new string[] {
          "Авдеевка",
          "Александровка",
          "Алексеевка",
          "Алексеево-Дружковка",
          "Амвросиевка",
          "Андреевка",
          "Бахмут",
          "Безыменное",
          "Беленькое",
          "Белицкое",
          "Белозерское",
          "Благодатное",
          "Великая Новоселка",
          "Владимировка",
          "Водянское",
          "Войковский",
          "Волноваха",
          "Гнутово",
          "Горловка",
          "Дальнее",
          "Дебальцево",
          "Доброполье",
          "Докучаевск",
          "Донецк",
          "Донское",
          "Дробышево",
          "Дружковка",
          "Енакиево",
          "Зеленополье",
          "Зугрэс",
          "Измайловка",
          "Иловайск",
          "Ильиновка",
          "Искра",
          "Кальчик",
          "Камышеваха",
          "Керамик",
          "Кировское",
          "Комсомольский",
          "Константиновка",
          "Краматорск",
          "Красная Поляна",
          "Красноармейск",
          "Красногоровка",
          "Кумачово",
          "Лиман",
          "Луганское",
          "Луганское",
          "Макеевка",
          "Мариуполь",
          "Марьинка",
          "Межевое",
          "Мемрик",
          "Мирное",
          "Московское",
          "Моспино",
          "Нижняя Крынка",
          "Никольское",
          "Новгородское",
          "Новоазовск",
          "Новоамвросиевское",
          "Новогродовка",
          "Новодонецкое",
          "Новониколаевка",
          "Новосергеевка",
          "Новотроицкое",
          "Новоукраинка",
          "Новый Свет",
          "Ольгинка",
          "Очеретино",
          "Первомайский",
          "Первомайское",
          "Первомайское",
          "Петровка",
          "Покровка",
          "Прибрежное",
          "Райгородок",
          "Райское",
          "Родинское",
          "Рубцы",
          "Сартана",
          "Свиридоновка",
          "Свободное",
          "Свято-Покровское",
          "Святогорск",
          "Северное",
          "Северск",
          "Седово",
          "Селидово",
          "Славянск",
          "Снежное",
          "Соледар",
          "Старобешево",
          "Старый Крым",
          "Тельманово",
          "Терны",
          "Торез",
          "Торецк",
          "Углегорск",
          "Урзуф",
          "Харцызск",
          "Хомутово",
          "Часов Яр",
          "Черкасское",
          "Шабельковка",
          "Шахтерск",
          "Широкино",
          "Ялта",
          "Яровая",
          "Ясиноватая",
          "Ясногорка"
        };

  //3. Массив улиц
  public static string[] Streets = new string[] {
    "1-я Александровка", "15 лет ЛКСМ",
    "230 Стрелковой Дивизии", "25 лет РККА",
    "50 Гвардейской Дивизии", "50 лет СССР",
    "60 лет СССР",
    "8 Марта",
    "Абакумова", "Автотранспортников", "Адыгейская", "Айлантовая", "Аксакова",
    "Алексинская", "Алёхина", "Алябьева", "Ананченко", "Антипова", "Антоновича", "Антропова",
    "Апрельская", "Аравийская", "Аристова", "Арктики", "Арктическая", "Армавирская", "Артековская",
    "Артёма", "Артёмовская", "Архитекторов", "Ахтырская",
    "Багратиона", "Байдукова", "Бакинских Комиссаров", "Баранникова", "Барнаульская", "Батайская",
    "Батищева", "Батумская", "Баумана", "Белостокская", "Бехтерева", "Бирюзова", "Благовещенская",
    "Благоустроенная", "Богатырская", "Боклевского", "Большая Магистральная", "Боткина", "Брикетная",
    "Бринько", "Бубнова", "Будённовских партизан", "Будённого", "Буковинская", "Булавина", "Бурденко",
    "Буровая", "Буслаева", "Бутурлиновская",
    "Вакуленчука", "Валентины Терешковой", "Валерия Арсёнова", "Вани Дреля", "Вахрушева", "Вековая",
    "Великоновосёлковская", "Вельяминова", "Верейского", "Верхняя", "Ветеринарная", "Взлётная",
    "Вильгельма Пика", "Вильнюсская", "Вити Коробкова", "Владычанского", "Воздушная", "Возрождения",
    "Воинская", "Войкова", "Волгоградская", "Воровского", "Восточная", "Высоцкого", "Вышнеградского",
    "Вьетнамская",
    "Газеты Комсомолец Донбасса", "Гаражная", "Гаргаева", "Гастрономическая", "Генерала Антонова",
    "Генерала Максима Козыря", "Георгия Димитрова", "Героев-панфиловцев", "Героическая", "Герцена",
    "Гонимова", "Горбачевского", "Горная", "Горновая", "Горностаевская", "Горького", "Горячкина",
    "Градостроителей", "Гурилёвых", "Гурьевская",
    "Дагестанская", "Дарницкая", "Дебальцевская", "Державная", "Диккенса", "Дмитрия Донского",
    "Дмитрия Казака", "Днепродзержинская", "Днестровская", "Добровольского", "Доменная", "Донецкая",
    "Донэнерго", "Дубравная", "Дунаевского",
    "Ельницкая", "Енисейская", "Ерёменко", "Ермолаева", "Ермолаевой", "Ермолая Жукова", "Ермоловой",
    "Ершова",
    "Жарикова", "Железнодорожная", "Жигулёвская", "Жмуры", "Жуковского",
    "Заварзина", "Закарпатская", "Замойского", "Заречная", "Заслонова", "Звягильского", "Зелёная",
    "Земледельческая", "Землянская", "Зональная", "Зоологическая", "Зуевская",
    "Ивана Сусанина", "Ивана Ткаченко", "Изюмовская", "Ильинская", "Индустрии", "Инженерная",
    "Ионина", "Ионова",
    "Кірова", "Кадиевская", "Казановой", "Калашникова", "Калинина", "Калужская", "Камышинская",
    "Капитана", "Ратникова", "Карагандинская", "Карамзина", "Карла Маркса", "Квиринга", "Кедрина",
    "Керамическая", "Кирова", "Клайпеды", "Клиническая", "Кобозева", "Кобрынской", "Коваля", "Кольцова",
    "Коммунаров", "Коммунистическая", "Композиторов", "Конева", "Королёвой", "Космонавтов",
    "Краковская", "Крамачука", "Красноармейская", "Красногоровская", "Краснодарская",
    "Краснознамённая", "Красной авиации", "Краснооктябрьская", "Краснофлотская",
    "Красочная", "Куйбышева", "Куприна", "Курганова", "Куценко",
    "Лабутенко", "Лазаренко", "Лебединского", "Левицкого", "Левобережная", "Ленинградская",
    "Лермонтова", "Лесная", "Летняя", "Лизы Чайкиной", "Листопрокатчиков", "Литвинова",
    "Литейщиков", "Литке", "Ломоносова", "Лохтина", "Луговая", "Луговцова", "Лузина", "Льва Толстого",
    "Любавина"
  };
    }
}
